In [5]:
from pandas import Series, DataFrame

In [6]:
import pandas as pd

In [37]:
obj = Series([1, 2, 3, -4, 5] , index = ['a' , 'b', 'c' , 'd' , 'e'])

In [38]:
obj

a    1
b    2
c    3
d   -4
e    5
dtype: int64

In [39]:
obj.values

array([ 1,  2,  3, -4,  5], dtype=int64)

In [41]:
obj['b']

2

In [42]:
obj['b'] = 89

In [43]:
obj['b']

89

In [44]:
obj[['c', 'a', 'd']]

c    3
a    1
d   -4
dtype: int64

In [45]:
obj[obj > 0]

a     1
b    89
c     3
e     5
dtype: int64

In [46]:
obj * 2

a      2
b    178
c      6
d     -8
e     10
dtype: int64

In [51]:
'e' in obj

True

In [55]:
input(how has today been my friend thanos)

SyntaxError: invalid syntax (<ipython-input-55-c537ffdf395e>, line 1)

In [64]:
data = { 'nigeria' : 'abuja'}

In [65]:
data

{'nigeria': 'abuja'}

In [66]:
obj = Series(data)

In [67]:
obj

nigeria    abuja
dtype: object

In [69]:
pd.notnull(obj)

nigeria    True
dtype: bool

In [72]:
data2 = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data2)

In [73]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [74]:
data2

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [77]:
bolu = DataFrame(obj)

In [78]:
bolu

             0
nigeria  abuja

In [86]:
frame = DataFrame(data2,columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])

In [87]:
frame

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [113]:
name = ('united states of america')
name.split(' ')
give = []
for outputs in name.split():
    give.append(outputs[0])
''.join(give).capitalize()

'Usoa'

In [111]:
names = 'nigeria'
names[:3]

'nig'

In [120]:
frame['debt']= [1,2,3,4,5]

In [121]:
frame

       year   state  pop  debt
one    2000    Ohio  1.5     1
two    2001    Ohio  1.7     2
three  2002    Ohio  3.6     3
four   2001  Nevada  2.4     4
five   2002  Nevada  2.9     5

In [131]:
'Ohio' in frame

False

In [144]:
earth = {'country' : ['nigeria' , 'united states of america', 'cameroon','morocco'],
                              'fifa rankings' : [100 , 40 ,1, 24]}

earth = (index

In [145]:
earth = (index = [ 'a' , 'b' ,'c' ,'d'])

SyntaxError: invalid syntax (<ipython-input-145-8d304b502227>, line 1)

In [139]:
DataFrame(earth)

                    country  fifa rankings
0                   nigeria            100
1  united states of america             40
2                  cameroon              1
3                   morocco             24

In [146]:
lis = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [147]:
gen = (i ** 2 for i in lis)

In [150]:
next(gen)

9

In [179]:
def gen1():
    for i in lis:
        yield i ** 2

In [180]:
g = gen1()

In [175]:
next(g)

25

In [181]:
for i in range(len(lis)):
    print(next(g))

1
4
9
16
25
36
49
64
81
100

In [184]:
name = input('what is your name?')

what is your name?my name is boluwatife

In [188]:
assert 3 == 4, 'Not equal'

AssertionError: Not equal

In [194]:
def divide(x, y):
    assert y != 0, 'Cant divide by zero'
    return x / y

In [195]:
divide(2,0)

AssertionError: Cant divide by zero

lets begin the assignment 
ask how many credit hours a student is doing
ask if the student is instate or out of state 
*296 for instate students
*1066 for students out of state

In [ ]:
credit_hours = input('how many credit hours do you do?')
credit_hours2 = input('are you instate?').upper()

In [ ]:
credit_hours

In [ ]:
credit_hours = input('how many credit hours do you do?')
credit_hours2 = input('are you instate?(yes or no)')
if credit_hours2 == yes:
    tuition = float(credit_hours * 296)
else:
    tuition = float(credit_hours * 1066)